УТ.ФБ_КоннекторШины/src/InformationRegisters/ш_ОчередьПакетовВШину/ш_ОчередьПакетовВШину.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ш_ОчередьПакетовВШину</name>
  <resources>
    <name>Пакет</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Отправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОчереди</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СистемаНазначения</name>
    <type>
      <types>CatalogRef.ш_Системы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПакета</name>
    <type>
      <types>EnumRef.ш_ВидыПакетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСообщения</name>
    <type>
      <types>CatalogRef.ш_ТипыСообщений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.ФБ_КоннекторШины/src/InformationRegisters/ш_ЛогОшибок/ш_ЛогОшибок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ш_ЛогОшибок</name>
  <resources>
    <name>КодОшибки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДанныеЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>УведомлениеОтправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Метод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.ФБ_КоннекторШины/src/Catalogs/ш_ПравилаФормированияПакетовДляОтправки/ш_ПравилаФормированияПакетовДляОтправки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ш_ПравилаФормированияПакетовДляОтправки</name>
  <attributes>
    <name>ИмяМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПакета</name>
    <type>
      <types>EnumRef.ш_ВидыПакетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщения</name>
    <type>
      <types>CatalogRef.ш_ТипыСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемаНазначения</name>
    <type>
      <types>CatalogRef.ш_Системы</types>
    </type>
  </attributes>
  <attributes>
    <name>Алгоритм</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ.ФБ_КоннекторШины/src/Catalogs/ш_ПравилаОбработкиПакетовПриПриеме/ш_ПравилаОбработкиПакетовПриПриеме.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ш_ПравилаОбработкиПакетовПриПриеме</name>
  <attributes>
    <name>СистемаОтправления</name>
    <type>
      <types>CatalogRef.ш_Системы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщения</name>
    <type>
      <types>CatalogRef.ш_ТипыСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПакета</name>
    <type>
      <types>EnumRef.ш_ВидыПакетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Алгоритм</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ.ФБ_КоннекторШины/src/CommonModules/ш_РаботаСшинойДанныхСервер/Module.bsl
#Область Интерфейс

Процедура ш_ПриЗаписиДокументаШинаДанныхПриЗаписи(Источник, Отказ) Экспорт
	
	Если НЕ ш_РаботаСШинойПовтИсп.ПроверитьВозможностьРаботыСШиной() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	РегистрыСведений.ш_ОчередьПакетовВШину.ЗаписатьПакетДляОтправки(СформироватьПакетПоОбъекту(Источник,"Документ"));
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ш_ПриПроведенииДокументаШинаДанныхОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если НЕ ш_РаботаСШинойПовтИсп.ПроверитьВозможностьРаботыСШиной() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	РегистрыСведений.ш_ОчередьПакетовВШину.ЗаписатьПакетДляОтправки(СформироватьПакетПоОбъекту(Источник,"Документ",РежимПроведения));
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ш_ПриЗаписиРегистраСведенийПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если НЕ ш_РаботаСШинойПовтИсп.ПроверитьВозможностьРаботыСШиной() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	РегистрыСведений.ш_ОчередьПакетовВШину.ЗаписатьПакетДляОтправки(СформироватьПакетПоОбъекту(Источник,"РегистрСведений"));
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ш_ПриЗаписиСправочникаШинаДанныхПриЗаписи(Источник, Отказ) Экспорт
	
	Если НЕ ш_РаботаСШинойПовтИсп.ПроверитьВозможностьРаботыСШиной() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	РегистрыСведений.ш_ОчередьПакетовВШину.ЗаписатьПакетДляОтправки(СформироватьПакетПоОбъекту(Источник,"Справочник"));
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция СформироватьПакетПоОбъекту(Объект, ВидОбъекта, РежимПроведения=Неопределено) Экспорт
	
	ИмяМетаданных=стрШаблон("%1.%2",ВидОбъекта,Объект.Метаданные().Имя);
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ш_ПравилаФормированияПакетовДляОтправки.ВидПакета КАК ВидПакета,
	             |	ш_ПравилаФормированияПакетовДляОтправки.ТипСообщения КАК ТипСообщения,
	             |	ш_ПравилаФормированияПакетовДляОтправки.СистемаНазначения КАК СистемаНазначения,
	             |	ш_ПравилаФормированияПакетовДляОтправки.Алгоритм КАК Алгоритм
	             |ИЗ
	             |	Справочник.ш_ПравилаФормированияПакетовДляОтправки КАК ш_ПравилаФормированияПакетовДляОтправки
	             |ГДЕ
	             |	ш_ПравилаФормированияПакетовДляОтправки.ИмяМетаданных = &ИмяМетаданных
	             |	И НЕ ш_ПравилаФормированияПакетовДляОтправки.ПометкаУдаления";
	Запрос.УстановитьПараметр("ИмяМетаданных",ИмяМетаданных);
	Выборка=Запрос.Выполнить().Выбрать();
	
	МассивПакетов=Новый Массив;
	Пока Выборка.Следующий() Цикл
		
		Сообщение="";
		Попытка
			Выполнить(Выборка.Алгоритм);
		Исключение
			ТекстОшибки=СформироватьОписаниеОшибки(ИнформацияОбОшибке());
			ЗаписатьОшибкуВЛог("СформироватьПакетПоОбъекту",ЗначениеВСтрокуВнутр(Объект.Ссылка),0,СтрШаблон("%1%2%3",ИмяМетаданных,Символы.ПС,ТекстОшибки));
			Продолжить;
		КонецПопытки;
		
		Если ЗначениеЗаполнено(Сообщение) Тогда
			
			Пакет=РегистрыСведений.ш_ОчередьПакетовВШину.ПолучитьСтруктуруПакетаДляДальнейшейОтправки();
			ЗаполнитьЗначенияСвойств(Пакет,Выборка);
			Пакет.Пакет=Сообщение;
			МассивПакетов.Добавить(Пакет);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивПакетов;
	
КонецФункции

Процедура ЗаписатьОшибкуВЛог(ИмяМетода,ДанныеЗапроса,КодОшибки,ТекстОшибки) Экспорт
	
	ИД=Строка(Новый УникальныйИдентификатор);
	Дата=ТекущаяДата();
	
	рег=РегистрыСведений.ш_ЛогОшибок.СоздатьНаборЗаписей();
	рег.Отбор.Дата.Установить(Дата,Истина);
	рег.Отбор.Метод.Установить(ИмяМетода,Истина);
	рег.Отбор.ИД.Установить(ИД,Истина);
	рег.ОбменДанными.Загрузка=Истина;
	
	стрРег=рег.Добавить();
	стрРег.Дата=Дата;
	стрРег.Метод=ИмяМетода;
	стрРег.ИД=ИД;
	стрРег.КодОшибки=КодОшибки;
	стрРег.ДанныеЗапроса=ДанныеЗапроса;
	стРрег.ТекстОшибки=ТекстОшибки;
	
	рег.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьСтрокуПодключения() Экспорт
	
	СтрокаПодключения = ВРЕГ(НСтр(СтрокаСоединенияИнформационнойБазы(), "Ref"));
	Если НЕ ЗначениеЗаполнено(СтрокаПодключения) Тогда
		СтрокаПодключения = ВРЕГ(НСтр(СтрокаСоединенияИнформационнойБазы(), "File"));
	КонецЕсли;
	
	Возврат СтрокаПодключения;
	
КонецФункции

#КонецОбласти

#Область РегламентныеЗадания

Процедура ш_ОтправкаДанныхВШину() Экспорт
	
	Если НЕ ш_РаботаСШинойПовтИсп.ПроверитьВозможностьРаботыСШиной() Тогда
		Возврат;
	КонецЕсли;
	
	МассивПакетов=Новый Массив;
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ш_ОчередьПакетовВШину.ИД КАК ИД,
	             |	ш_ОчередьПакетовВШину.СистемаНазначения КАК СистемаНазначения,
	             |	ш_ОчередьПакетовВШину.ВидПакета КАК ВидПакета,
	             |	ш_ОчередьПакетовВШину.ТипСообщения.Наименование КАК ТипСообщенияНаименование,
	             |	ш_ОчередьПакетовВШину.Пакет КАК Пакет,
	             |	ш_ОчередьПакетовВШину.ТипСообщения КАК ТипСообщения,
	             |	ш_ОчередьПакетовВШину.ДатаОчереди КАК ДатаОчереди
	             |ИЗ
	             |	РегистрСведений.ш_ОчередьПакетовВШину КАК ш_ОчередьПакетовВШину
	             |ГДЕ
	             |	НЕ ш_ОчередьПакетовВШину.Отправлен
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ДатаОчереди";
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Пакет=ПолучитьСтруктуруПакета();
		Пакет.id=Выборка.ИД;
		Пакет.type=?(Выборка.ВидПакета=Перечисления.ш_ВидыПакетов.Адресный,"personal","all");
		Пакет.destination=?(ЗначениеЗаполнено(Выборка.СистемаНазначения),Строка(Выборка.СистемаНазначения.УникальныйИдентификатор()),"");
		Пакет.name=Выборка.ТипСообщенияНаименование;
		Пакет.data=Выборка.Пакет;
		МассивПакетов.Добавить(Пакет);
		
	КонецЦикла;
	
	ДанныеПодключенияКШине=ш_РаботаСШинойПовтИсп.ПолучитьПараметрыШины();
	Если НЕ ЗначениеЗаполнено(ДанныеПодключенияКШине.КоличествоОтправляемыхПакетовЗаРаз) Тогда
		РазмерПорции=100;
	Иначе
		РазмерПорции=ДанныеПодключенияКШине.КоличествоОтправляемыхПакетовЗаРаз;
	КонецЕсли;
	
	Для н=1 По Цел(МассивПакетов.Количество()/РазмерПорции)+1 Цикл
		
		ПакетыДляОтправки=Новый Массив;
		Для к=0 По РазмерПорции-1 Цикл
			
			ТекущийИндекс=(н-1)*РазмерПорции+к;
			Если ТекущийИндекс>МассивПакетов.Количество()-1 Тогда
				Прервать;
			КонецЕсли;
			
			ПакетыДляОтправки.Добавить(МассивПакетов[ТекущийИндекс]);
		КонецЦикла;
		
		Если ПакетыДляОтправки.Количество()>0 Тогда
			
			Результат=ш_ЗапросыКШинеСервер.ОтправитьПакетыВШину(МассивПакетов);
			Если Результат.Результат Тогда
				
				Ошибки=Новый Соответствие;
				Для каждого стрДанные Из Результат.Данные Цикл
					Ошибки.Вставить(стрДанные.id,стрДанные.error);
				КонецЦикла;
				
				Выборка.Сбросить();
				Пока Выборка.Следующий() Цикл
					
					рег=РегистрыСведений.ш_ОчередьПакетовВШину.СоздатьНаборЗаписей();
					рег.Отбор.ИД.Установить(Выборка.ИД,Истина);
					
					стрРег=рег.Добавить();
					ЗаполнитьЗначенияСвойств(стрРег,Выборка);
					стрРег.Отправлен=Истина;
					стрРег.ДатаОтправки=ТекущаяДата();
					стрРег.Ошибка=Ошибки[Выборка.ИД];
					
					рег.Записать(Истина);
					
				КонецЦикла;
					
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ш_ПолучениеДанныхИзШины() Экспорт
	
	Если НЕ ш_РаботаСШинойПовтИсп.ПроверитьВозможностьРаботыСШиной() Тогда
		Возврат;
	КонецЕсли;
	
	Результат=ш_ЗапросыКШинеСервер.ПолучитьПакетыИзШины();
	Если Результат.Результат Тогда
		
		Если ТипЗнч(Результат.Данные)=Тип("Массив") Тогда
			
			Если Результат.Данные.Количество()>0 Тогда
				
				МассивИД=Новый Массив;
				Для каждого стрПакет Из Результат.Данные Цикл
					
					рег=РегистрыСведений.ш_ОчередьПакетовИзШины.СоздатьНаборЗаписей();
					рег.Отбор.ИД.Установить(стрПакет.id,Истина);
					
					стрРег=рег.Добавить();
					стрРег.ИД=стрПакет.id;
					стрРег.Система=Справочники.ш_Системы.ПолучитьСистемуПоИД(стрПакет.from);
					стрРег.ВидПакета=?(стрПакет.type="personal",Перечисления.ш_ВидыПакетов.Адресный,Перечисления.ш_ВидыПакетов.Широковещательный);
					стрРег.ТипСообщения=ш_РаботаСШинойПовтИсп.ПолучитьТипСообщения(стрПакет.name);
					стрРег.Пакет=стрПакет.data;
					стрРег.ДатаПолучения=ТекущаяДатаСеанса();
					
					рег.ОбменДанными.Загрузка=Истина;
					рег.Записать(Истина);
					
					МассивИД.Добавить(стрПакет.id);
					
				КонецЦикла;
				
				Результат=ш_ЗапросыКШинеСервер.ОтправитьПодтверждениеПолученияДанных(МассивИД);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ш_ОбработкаОчередиСообщенийИзШины() Экспорт
	
	Если НЕ ш_РаботаСШинойПовтИсп.ПроверитьВозможностьРаботыСШиной() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыШины=ш_РаботаСШинойПовтИсп.ПолучитьПараметрыШины();
	МаксимальноеКоличествоОбработкиПакетовИзШины=0;
	ПараметрыШины.Свойство("МаксимальноеКоличествоОбработкиПакетовИзШины",МаксимальноеКоличествоОбработкиПакетовИзШины);
	Если НЕ ЗначениеЗаполнено(МаксимальноеКоличествоОбработкиПакетовИзШины) Тогда
		МаксимальноеКоличествоОбработкиПакетовИзШины=3;
	КонецЕсли;
	
	// 1. пакеты с произвольным алгоритмом обмена
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("МаксимальноеКоличествоОбработкиПакетовИзШины",МаксимальноеКоличествоОбработкиПакетовИзШины);
	Запрос.Текст="ВЫБРАТЬ
	             |	ш_ОчередьПакетовИзШины.ИД КАК ИД,
	             |	ш_ОчередьПакетовИзШины.Система КАК Система,
	             |	ш_ОчередьПакетовИзШины.ВидПакета КАК ВидПакета,
	             |	ш_ОчередьПакетовИзШины.ТипСообщения КАК ТипСообщения,
	             |	ш_ОчередьПакетовИзШины.Пакет КАК Пакет,
	             |	ш_ПравилаОбработкиПакетовПриПриеме.Алгоритм КАК Алгоритм,
	             |	ш_ПравилаОбработкиПакетовПриПриеме.Ссылка КАК Ссылка,
	             |	ш_ОчередьПакетовИзШины.ДатаПолучения КАК ДатаПолучения,
	             |	ш_ОчередьПакетовИзШины.КоличествоПопыток КАК КоличествоПопыток
	             |ИЗ
	             |	РегистрСведений.ш_ОчередьПакетовИзШины КАК ш_ОчередьПакетовИзШины
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ш_ПравилаОбработкиПакетовПриПриеме КАК ш_ПравилаОбработкиПакетовПриПриеме
	             |		ПО (ш_ОчередьПакетовИзШины.ВидПакета = ш_ПравилаОбработкиПакетовПриПриеме.ВидПакета
	             |				ИЛИ ш_ПравилаОбработкиПакетовПриПриеме.ВидПакета = ЗНАЧЕНИЕ(Перечисление.ш_ВидыПакетов.ПустаяСсылка))
	             |			И ш_ОчередьПакетовИзШины.ТипСообщения = ш_ПравилаОбработкиПакетовПриПриеме.ТипСообщения
	             |			И (ш_ОчередьПакетовИзШины.Система = ш_ПравилаОбработкиПакетовПриПриеме.СистемаОтправления
	             |				ИЛИ ш_ПравилаОбработкиПакетовПриПриеме.СистемаОтправления = ЗНАЧЕНИЕ(Справочник.ш_Системы.ПустаяСсылка))
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ПланОбмена.ш_ОбменДаннымиПоПравиламКД2 КАК ш_ОбменДаннымиПоПравиламКД2
	             |		ПО ш_ОчередьПакетовИзШины.Система = ш_ОбменДаннымиПоПравиламКД2.Система
	             |			И ш_ОчередьПакетовИзШины.ТипСообщения = ш_ОбменДаннымиПоПравиламКД2.ТипСообщенияОбмена
	             |			И (ш_ОбменДаннымиПоПравиламКД2.Загрузка)
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ПланОбмена.ш_ОбменДаннымиПоПравиламКД3 КАК ш_ОбменДаннымиПоПравиламКД3
	             |		ПО ш_ОчередьПакетовИзШины.ТипСообщения = ш_ОбменДаннымиПоПравиламКД3.ТипСообщенияОбмена
	             |			И ш_ОчередьПакетовИзШины.Система = ш_ОбменДаннымиПоПравиламКД3.Система
	             |			И (ш_ОбменДаннымиПоПравиламКД3.Загрузка)
	             |ГДЕ
	             |	НЕ ш_ОчередьПакетовИзШины.Обработано
	             |	И ш_ОчередьПакетовИзШины.КоличествоПопыток <= &МаксимальноеКоличествоОбработкиПакетовИзШины
	             |	И ш_ОбменДаннымиПоПравиламКД2.Ссылка ЕСТЬ NULL
	             |	И ш_ОбменДаннымиПоПравиламКД3.Ссылка ЕСТЬ NULL
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ш_ОчередьПакетовИзШины.ДатаПолучения";
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Пакет<>"" Тогда
			Пакет=ПолучитьОбъектИзJSON(Выборка.Пакет);
		Иначе
			Пакет=Неопределено
		КонецЕсли;
		
		Попытка
			Выполнить(Выборка.Алгоритм);
		Исключение
			ТекстОшибки=СформироватьОписаниеОшибки(ИнформацияОбОшибке());
			ЗаписатьОшибкуВЛог("ш_ОбработкаОчередиСообщенийИзШины",ЗначениеВСтрокуВнутр(Выборка.Ссылка),0,СтрШаблон("%1%2%3",Выборка.ИД,Символы.ПС,ТекстОшибки));
			
			рег=РегистрыСведений.ш_ОчередьПакетовИзШины.СоздатьНаборЗаписей();
			рег.Отбор.ИД.Установить(Выборка.ИД,Истина);
			
			стрРег=рег.Добавить();
			ЗаполнитьЗначенияСвойств(стрРег,Выборка);
			стрРег.ДатаОбработки=ТекущаяДатаСеанса();
			стрРег.КоличествоПопыток=стрРег.КоличествоПопыток+1;
			стрРег.ТекстОшибки=ТекстОшибки;
			рег.ОбменДанными.Загрузка=Истина;
			рег.Записать(Истина);
			
			Продолжить;
			
		КонецПопытки;
		
		рег=РегистрыСведений.ш_ОчередьПакетовИзШины.СоздатьНаборЗаписей();
		рег.Отбор.ИД.Установить(Выборка.ИД,Истина);
		
		стрРег=рег.Добавить();
		ЗаполнитьЗначенияСвойств(стрРег,Выборка);
		стрРег.ДатаОбработки=ТекущаяДатаСеанса();
		стрРег.Обработано=Истина;
		
		рег.ОбменДанными.Загрузка=Истина;
		рег.Записать(Истина);
		
	КонецЦикла;
	
	// 2. КД 2.0
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("МаксимальноеКоличествоОбработкиПакетовИзШины",МаксимальноеКоличествоОбработкиПакетовИзШины);
	Запрос.Текст="ВЫБРАТЬ
	             |	ш_ОчередьПакетовИзШины.ИД КАК ИД,
	             |	ш_ОчередьПакетовИзШины.Система КАК Система,
	             |	ш_ОчередьПакетовИзШины.ВидПакета КАК ВидПакета,
	             |	ш_ОчередьПакетовИзШины.ТипСообщения КАК ТипСообщения,
	             |	ш_ОчередьПакетовИзШины.Пакет КАК Пакет,
	             |	ш_ОчередьПакетовИзШины.ДатаПолучения КАК ДатаПолучения,
	             |	ш_ОчередьПакетовИзШины.КоличествоПопыток КАК КоличествоПопыток,
	             |	ш_ОбменДаннымиПоПравиламКД2.Ссылка КАК УзелОбмена
	             |ИЗ
	             |	РегистрСведений.ш_ОчередьПакетовИзШины КАК ш_ОчередьПакетовИзШины
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланОбмена.ш_ОбменДаннымиПоПравиламКД2 КАК ш_ОбменДаннымиПоПравиламКД2
	             |		ПО ш_ОчередьПакетовИзШины.Система = ш_ОбменДаннымиПоПравиламКД2.Система
	             |			И ш_ОчередьПакетовИзШины.ТипСообщения = ш_ОбменДаннымиПоПравиламКД2.ТипСообщенияОбмена
	             |			И (ш_ОбменДаннымиПоПравиламКД2.Загрузка)
	             |ГДЕ
	             |	НЕ ш_ОчередьПакетовИзШины.Обработано
	             |	И ш_ОчередьПакетовИзШины.КоличествоПопыток <= &МаксимальноеКоличествоОбработкиПакетовИзШины
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ш_ОчередьПакетовИзШины.ДатаПолучения";
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			ш_РаботаСПравиламиОбмена.ЗагрузитьДанныеПоПравиламОбмена20(Выборка.Пакет);
			
		Исключение
			ТекстОшибки=СформироватьОписаниеОшибки(ИнформацияОбОшибке());
			ЗаписатьОшибкуВЛог("ш_ОбработкаОчередиСообщенийИзШины",ЗначениеВСтрокуВнутр(Выборка.УзелОбмена),0,СтрШаблон("%1%2%3",Выборка.ИД,Символы.ПС,ТекстОшибки));
			
			рег=РегистрыСведений.ш_ОчередьПакетовИзШины.СоздатьНаборЗаписей();
			рег.Отбор.ИД.Установить(Выборка.ИД,Истина);
			
			стрРег=рег.Добавить();
			ЗаполнитьЗначенияСвойств(стрРег,Выборка);
			стрРег.ДатаОбработки=ТекущаяДатаСеанса();
			стрРег.КоличествоПопыток=стрРег.КоличествоПопыток+1;
			стрРег.ТекстОшибки=ТекстОшибки;
			рег.ОбменДанными.Загрузка=Истина;
			рег.Записать(Истина);
			
			Продолжить;
			
		КонецПопытки;
		
		рег=РегистрыСведений.ш_ОчередьПакетовИзШины.СоздатьНаборЗаписей();
		рег.Отбор.ИД.Установить(Выборка.ИД,Истина);
		
		стрРег=рег.Добавить();
		ЗаполнитьЗначенияСвойств(стрРег,Выборка);
		стрРег.ДатаОбработки=ТекущаяДатаСеанса();
		стрРег.Обработано=Истина;
		
		рег.ОбменДанными.Загрузка=Истина;
		рег.Записать(Истина);
		
	КонецЦикла;
	
	// 3. КД 3.1
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("МаксимальноеКоличествоОбработкиПакетовИзШины",МаксимальноеКоличествоОбработкиПакетовИзШины);
	Запрос.Текст="ВЫБРАТЬ
	             |	ш_ОчередьПакетовИзШины.ИД КАК ИД,
	             |	ш_ОчередьПакетовИзШины.Система КАК Система,
	             |	ш_ОчередьПакетовИзШины.ВидПакета КАК ВидПакета,
	             |	ш_ОчередьПакетовИзШины.ТипСообщения КАК ТипСообщения,
	             |	ш_ОчередьПакетовИзШины.Пакет КАК Пакет,
	             |	ш_ОчередьПакетовИзШины.ДатаПолучения КАК ДатаПолучения,
	             |	ш_ОчередьПакетовИзШины.КоличествоПопыток КАК КоличествоПопыток,
	             |	ш_ОбменДаннымиПоПравиламКД3.Ссылка КАК УзелОбмена
	             |ИЗ
	             |	РегистрСведений.ш_ОчередьПакетовИзШины КАК ш_ОчередьПакетовИзШины
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланОбмена.ш_ОбменДаннымиПоПравиламКД3 КАК ш_ОбменДаннымиПоПравиламКД3
	             |		ПО ш_ОчередьПакетовИзШины.Система = ш_ОбменДаннымиПоПравиламКД3.Система
	             |			И ш_ОчередьПакетовИзШины.ТипСообщения = ш_ОбменДаннымиПоПравиламКД3.ТипСообщенияОбмена
	             |			И (ш_ОбменДаннымиПоПравиламКД3.Загрузка)
	             |ГДЕ
	             |	НЕ ш_ОчередьПакетовИзШины.Обработано
	             |	И ш_ОчередьПакетовИзШины.КоличествоПопыток <= &МаксимальноеКоличествоОбработкиПакетовИзШины
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ш_ОчередьПакетовИзШины.ДатаПолучения";
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			ш_РаботаСПравиламиОбмена.ЗагрузитьДанныеКД3(Выборка.Пакет);
			
		Исключение
			ТекстОшибки=СформироватьОписаниеОшибки(ИнформацияОбОшибке());
			ЗаписатьОшибкуВЛог("ш_ОбработкаОчередиСообщенийИзШины",ЗначениеВСтрокуВнутр(Выборка.УзелОбмена),0,СтрШаблон("%1%2%3",Выборка.ИД,Символы.ПС,ТекстОшибки));
			
			рег=РегистрыСведений.ш_ОчередьПакетовИзШины.СоздатьНаборЗаписей();
			рег.Отбор.ИД.Установить(Выборка.ИД,Истина);
			
			стрРег=рег.Добавить();
			ЗаполнитьЗначенияСвойств(стрРег,Выборка);
			стрРег.ДатаОбработки=ТекущаяДатаСеанса();
			стрРег.КоличествоПопыток=стрРег.КоличествоПопыток+1;
			стрРег.ТекстОшибки=ТекстОшибки;
			рег.ОбменДанными.Загрузка=Истина;
			рег.Записать(Истина);
			
			Продолжить;
			
		КонецПопытки;
		
		рег=РегистрыСведений.ш_ОчередьПакетовИзШины.СоздатьНаборЗаписей();
		рег.Отбор.ИД.Установить(Выборка.ИД,Истина);
		
		стрРег=рег.Добавить();
		ЗаполнитьЗначенияСвойств(стрРег,Выборка);
		стрРег.ДатаОбработки=ТекущаяДатаСеанса();
		стрРег.Обработано=Истина;
		
		рег.ОбменДанными.Загрузка=Истина;
		рег.Записать(Истина);
		
	КонецЦикла;
	
	// 4. Синхронизация данных
	Запрос.Текст = "ВЫБРАТЬ
	               |	Данные.Ссылка КАК Ссылка,
	               |	Данные.ТипСообщенияОбмена КАК ТипСообщенияОбмена,
	               |	Данные.Система КАК Система,
	               |	Данные.СценарийОбменаДанными КАК СценарийОбменаДанными,
	               |	ш_ОчередьПакетовИзШины.ИД КАК ИД
	               |ИЗ
	               |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |		Данные.Ссылка КАК Ссылка,
	               |		МАКСИМУМ(Данные.ТипСообщенияОбмена) КАК ТипСообщенияОбмена,
	               |		МАКСИМУМ(Данные.Система) КАК Система,
	               |		МАКСИМУМ(Данные.СценарийОбменаДанными) КАК СценарийОбменаДанными
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			НастройкиТранспортаСообщенийОбменаНастройки.Ссылка КАК Ссылка,
	               |			НастройкиТранспортаСообщенийОбменаНастройки.Значение КАК ТипСообщенияОбмена,
	               |			NULL КАК Система,
	               |			NULL КАК СценарийОбменаДанными
	               |		ИЗ
	               |			Справочник.НастройкиТранспортаСообщенийОбмена.Настройки КАК НастройкиТранспортаСообщенийОбменаНастройки
	               |		ГДЕ
	               |			НастройкиТранспортаСообщенийОбменаНастройки.Ссылка.ИдентификаторТранспорта = ""ш_ESB""
	               |			И НЕ НастройкиТранспортаСообщенийОбменаНастройки.Ссылка.ПометкаУдаления
	               |			И НастройкиТранспортаСообщенийОбменаНастройки.Ссылка.НастройкаПоУмолчанию
	               |			И НастройкиТранспортаСообщенийОбменаНастройки.Настройка = ""ТипСообщенияОбмена""
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			НастройкиТранспортаСообщенийОбменаНастройки.Ссылка,
	               |			NULL,
	               |			НастройкиТранспортаСообщенийОбменаНастройки.Значение,
	               |			NULL
	               |		ИЗ
	               |			Справочник.НастройкиТранспортаСообщенийОбмена.Настройки КАК НастройкиТранспортаСообщенийОбменаНастройки
	               |		ГДЕ
	               |			НастройкиТранспортаСообщенийОбменаНастройки.Ссылка.ИдентификаторТранспорта = ""ш_ESB""
	               |			И НЕ НастройкиТранспортаСообщенийОбменаНастройки.Ссылка.ПометкаУдаления
	               |			И НастройкиТранспортаСообщенийОбменаНастройки.Ссылка.НастройкаПоУмолчанию
	               |			И НастройкиТранспортаСообщенийОбменаНастройки.Настройка = ""Система""
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			НастройкиТранспортаСообщенийОбменаНастройки.Ссылка,
	               |			NULL,
	               |			NULL,
	               |			НастройкиТранспортаСообщенийОбменаНастройки.Значение
	               |		ИЗ
	               |			Справочник.НастройкиТранспортаСообщенийОбмена.Настройки КАК НастройкиТранспортаСообщенийОбменаНастройки
	               |		ГДЕ
	               |			НастройкиТранспортаСообщенийОбменаНастройки.Ссылка.ИдентификаторТранспорта = ""ш_ESB""
	               |			И НЕ НастройкиТранспортаСообщенийОбменаНастройки.Ссылка.ПометкаУдаления
	               |			И НастройкиТранспортаСообщенийОбменаНастройки.Ссылка.НастройкаПоУмолчанию
	               |			И НастройкиТранспортаСообщенийОбменаНастройки.Настройка = ""СценарийОбменаДанными"") КАК Данные
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		Данные.Ссылка) КАК Данные
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ш_ОчередьПакетовИзШины КАК ш_ОчередьПакетовИзШины
	               |		ПО Данные.ТипСообщенияОбмена = ш_ОчередьПакетовИзШины.ТипСообщения
	               |			И Данные.Система = ш_ОчередьПакетовИзШины.Система
	               |			И (НЕ ш_ОчередьПакетовИзШины.Обработано)
	               |			И (ш_ОчередьПакетовИзШины.КоличествоПопыток <= &МаксимальноеКоличествоОбработкиПакетовИзШины)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ТипСообщенияОбмена) И ЗначениеЗаполнено(Выборка.Система) И ЗначениеЗаполнено(Выборка.СценарийОбменаДанными) Тогда
			ОбменДаннымиСервер.ВыполнитьОбменДаннымиПоСценариюОбменаДанными(Ложь, Выборка.СценарийОбменаДанными);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ш_КонтрольРаботыИОповещения() Экспорт
	
	Если НЕ ш_РаботаСШинойПовтИсп.ПроверитьВозможностьРаботыСШиной() Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ш_ВыполнениеОбменаПоПравиламКД2(УзелОбмена) Экспорт
	
	Если НЕ ш_РаботаСШинойПовтИсп.ПроверитьВозможностьРаботыСШиной() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(УзелОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ УзелОбмена.Использование Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ УзелОбмена.Выгрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Пакет=РегистрыСведений.ш_ОчередьПакетовВШину.ПолучитьСтруктуруПакетаДляДальнейшейОтправки();
	
	Пакет.СистемаНазначения = УзелОбмена.Система;
	Пакет.ТипСообщения = УзелОбмена.ТипСообщенияОбмена;
	Пакет.ВидПакета = Перечисления.ш_ВидыПакетов.Адресный;
	
	Правила = УзелОбмена.ПравилаОбменаДанными.Получить();
	
	ДанныеДляВыгрузки = ш_РаботаСПравиламиОбмена.ВыгрузитьДанныеПоПравиламОбмена20(УзелОбмена, Правила);
	Если ЗначениеЗаполнено(ДанныеДляВыгрузки) Тогда
		
		Пакет.Пакет = ДанныеДляВыгрузки;
		РегистрыСведений.ш_ОчередьПакетовВШину.ЗаписатьПакетДляОтправки(Пакет);
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ш_ВыполнениеОбменаПоПравиламКД3(УзелОбмена) Экспорт
	
	Если НЕ ш_РаботаСШинойПовтИсп.ПроверитьВозможностьРаботыСШиной() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(УзелОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ УзелОбмена.Использование Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ УзелОбмена.Выгрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Пакет=РегистрыСведений.ш_ОчередьПакетовВШину.ПолучитьСтруктуруПакетаДляДальнейшейОтправки();
	
	Пакет.СистемаНазначения = УзелОбмена.Система;
	Пакет.ТипСообщения = УзелОбмена.ТипСообщенияОбмена;
	Пакет.ВидПакета = Перечисления.ш_ВидыПакетов.Адресный;
	
	МассивДанных = Новый Массив;
	Выборка = ПланыОбмена.ВыбратьИзменения(УзелОбмена, УзелОбмена.НомерОтправленного + 1);
	Пока Выборка.Следующий() Цикл
		МассивДанных.Добавить(Выборка.Получить());
	КонецЦикла;
	
	Пакет.Пакет = ш_РаботаСПравиламиОбмена.ЗагрузитьДанныеКД3(МассивДанных);
	
	РегистрыСведений.ш_ОчередьПакетовВШину.ЗаписатьПакетДляОтправки(Пакет);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ш_ОчисткаУстаревшихДанных() Экспорт
	
	ПараметрыШины = ш_РаботаСШинойПовтИсп.ПолучитьПараметрыШины();
	
	Если ПараметрыШины.УдалятьОтработанныеПакеты = Истина Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ш_ОчередьПакетовВШину.ИД КАК ИД,
		|	ш_ОчередьПакетовВШину.ДатаОчереди КАК ДатаОчереди,
		|	ш_ОчередьПакетовВШину.СистемаНазначения КАК СистемаНазначения,
		|	ш_ОчередьПакетовВШину.ВидПакета КАК ВидПакета,
		|	ш_ОчередьПакетовВШину.ТипСообщения КАК ТипСообщения
		|ИЗ
		|	РегистрСведений.ш_ОчередьПакетовВШину КАК ш_ОчередьПакетовВШину
		|ГДЕ
		|	ш_ОчередьПакетовВШину.Отправлен
		|	И ш_ОчередьПакетовВШину.ДатаОчереди < &ДатаОчистки";
		
		Запрос.УстановитьПараметр("ДатаОчистки", ТекущаяДатаСеанса() - 86400 * ПараметрыШины.КоличествоДнейХраненияОтработанныхПакетов);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			рег = РегистрыСведений.ш_ОчередьПакетовВШину.СоздатьНаборЗаписей();
			рег.Отбор.ИД.Установить(Выборка.ИД, Истина);
			рег.Отбор.ДатаОчереди.Установить(Выборка.ДатаОчереди, Истина);
			рег.Отбор.СистемаНазначения.Установить(Выборка.СистемаНазначения, Истина);
			рег.Отбор.ВидПакета.Установить(Выборка.ВидПакета, Истина);
			рег.Отбор.ТипСообщения.Установить(Выборка.ТипСообщения, Истина);
			
			рег.ОбменДанными.Загрузка = Истина;
			рег.Записать(Истина);
			
		КонецЦикла;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ш_ОчередьПакетовИзШины.ИД КАК ИД,
		|	ш_ОчередьПакетовИзШины.Система КАК Система,
		|	ш_ОчередьПакетовИзШины.ВидПакета КАК ВидПакета,
		|	ш_ОчередьПакетовИзШины.ТипСообщения КАК ТипСообщения
		|ИЗ
		|	РегистрСведений.ш_ОчередьПакетовИзШины КАК ш_ОчередьПакетовИзШины
		|ГДЕ
		|	ш_ОчередьПакетовИзШины.Обработано
		|	И ш_ОчередьПакетовИзШины.ДатаПолучения < &ДатаОчистки";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			рег = РегистрыСведений.ш_ОчередьПакетовИзШины.СоздатьНаборЗаписей();
			рег.Отбор.ИД.Установить(Выборка.ИД, Истина);
			рег.Отбор.Система.Установить(Выборка.Система, Истина);
			рег.Отбор.ВидПакета.Установить(Выборка.ВидПакета, Истина);
			рег.Отбор.ТипСообщения.Установить(Выборка.ТипСообщения, Истина);
			
			рег.ОбменДанными.Загрузка = Истина;
			рег.Записать(Истина);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

Функция ПолучитьСтруктуруОтвета() Экспорт
	
	Результат=Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("Данные");
	Результат.Вставить("КодОшибки");
	Результат.Вставить("ТекстОшибки");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруПакета() Экспорт
	
	Результат=Новый Структура;
	Результат.Вставить("id","");
	Результат.Вставить("type","");
	Результат.Вставить("destination","");
	Результат.Вставить("name","");
	Результат.Вставить("data","");
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьОшибкуДляВозврата(Ответ,КодОшибки,ТекстОшибки) Экспорт
	
	Ответ.Результат=Ложь;
	Ответ.КодОшибки=КодОшибки;
	Ответ.ТекстОшибки=ТекстОшибки;
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьОбъектИзJSON(СтрокаJSON) Экспорт
	
	Чтение=Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	Объект=ПрочитатьJSON(Чтение,,,ФорматДатыJSON.ISO);
	Чтение.Закрыть();
	
	Возврат Объект;
	
КонецФункции

Функция ЗаписатьОбъектВJSON(Объект) Экспорт
	
	Запись=Новый ЗаписьJSON;
	
	ПараметрыЗаписи=Новый ПараметрыЗаписиJSON(,Символы.Таб,,ЭкранированиеСимволовJSON.СимволыВнеBMP,,,,,Истина);
	Запись.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(Запись,Объект);
	
	ТекСтрока=Запись.Закрыть();
	
	Возврат ТекСтрока;
		
КонецФункции

Процедура СообщитьПользователю(Знач ТекстСообщенияПользователю, Знач КлючДанных = Неопределено,	Знач Поле = "",
	Знач ПутьКДанным = "", Отказ = Ложь) Экспорт
	
	ЭтоОбъект = Ложь;
	
	Если КлючДанных <> Неопределено
		И XMLТипЗнч(КлючДанных) <> Неопределено Тогда
		
		ТипЗначенияСтрокой = XMLТипЗнч(КлючДанных).ИмяТипа;
		ЭтоОбъект = СтрНайти(ТипЗначенияСтрокой, "Object.") > 0;
	КонецЕсли;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.Поле = Поле;
	
	Если ЭтоОбъект Тогда
		Сообщение.УстановитьДанные(КлючДанных);
	Иначе
		Сообщение.КлючДанных = КлючДанных;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
	
	Сообщение.Сообщить();
	
	Отказ = Истина;
	
КонецПроцедуры

Функция СформироватьОписаниеОшибки(ИнформацияОбОшибке) Экспорт
	
	Результат=СтрШаблон("Описание=%1
						|ИмяМодуля=%2
						|НомерСтроки=%3
						|ИсходнаяСтрока=%4
						|ДополнительнаяИнформация=%5
						|Код=%6
						|Приичина=%7
						|Подробно=%8",ИнформацияОбОшибке.Описание,ИнформацияОбОшибке.ИмяМодуля,ИнформацияОбОшибке.НомерСтроки,ИнформацияОбОшибке.ИсходнаяСтрока,ИнформацияОбОшибке.ДополнительнаяИнформация,ИнформацияОбОшибке.Код,ИнформацияОбОшибке.Причина, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
